export default {
    title: 'LMeXSについて',
    html: /* html */`
<div class="intro-container">
    <h1>LMeXS.exe - Local Management eXperimental System</h1>
    <p>実験的なローカル管理システム</p>
    <ul>
        <li>※これはあくまで構想で、まだコードは作成していません。※</li>
        <li>目指しているのは某SEGA社のALLSと同等レベルの管理性能を誇りつつも、完全に端末内で動作するシステムです。</li>
        <li>この構想で使用する予定の言語はC#とC++/CLIです。</li>
        <li>C#でメインUI、C++/CLIでアンマネージドコードをラッピングしたセミマネージドDLLを作成する計画です。</li>
        <li>なお、この計画で作成するのはツールキットで、個人で完全に調整可能にすることも当然目指します。</li>
        <li>そのため、安全管理などで膨大なコストが必要となることが予想されます。</li>
    </ul>
    <p>この構想の初期完成は2025年中を目指していましたが、開発は中止になりました。公開もありません。</p>
</div>
`,
};
