export default {
    title: 'About LMeXS',
    html: /* html */`
<div class="intro-container">
    <h1>LMeXS.exe - Local Management eXperimental System</h1>
    <p>実験的なローカル管理システム</p>
    <ul>
        <li>これはあくまで構想で、まだコードは作成していません。</li>
        <li>目指しているのはSEGA社のALLSと同等レベルの管理性能を誇りつつも、完全に端末内で動作するシステムです。</li>
        <li>この構想で使用する予定の言語はC#とC++/CLIです。</li>
        <li>C#でメインUI、C++/CLIでアンマネージドコードをラッピングしたセミマネージドDLLを作成する計画です。</li>
        <li>なお、この計画で作成するのはツールキットで、個人で完全に調整可能にすることも当然目指します。</li>
        <li>そのため、安全管理などで膨大なコストが必要となることが予想されます。</li>
    </ul>
    <p>この構想の初期完成は今年中を目指していますが、状況によっては大幅に企画が変更となる、もしくは開発が中止される可能性があります。</p>
</div>
`,
};
